//=============================================================================
// 
//  プレイヤー決めヘッダー [decideplayer.h]
//  Author : 相馬靜雅
// 
//=============================================================================

#ifndef _DECIDEPLAYER_H_
#define _DECIDEPLAYER_H_	// 二重インクルード防止

#include "main.h"
#include "manager.h"

//==========================================================================
// 前方宣言
//==========================================================================

//==========================================================================
// クラス定義
//==========================================================================
// プレイヤー決めクラス定義
class CDecidePlayer : public CScene
{
public:

	CDecidePlayer();
	~CDecidePlayer();

	// オーバーライドされた関数
	HRESULT Init(void);
	void Uninit(void);
	void Update(void);
	void Draw(void);

private:


};



#endif